<?php
        $s = 10000;
        if ($s<=9999){
            echo "เงินเดือน = $s บาท<br>";
            echo "------------------------------------<br>";
            echo "ไม่มีโบนัส<br>";
            echo "รายรับสุทธิ = $s บาท<br>";
            echo "------------------------------------<br>";
        }else if ($s<=49999){
            echo "เงินเดือน = $s บาท<br>";
            echo "------------------------------------<br>";
            echo "โบนัส = ".($s* 3)." บาท<br>";
            echo "รายรับสุทธิ = ".($s+($s* 3))." บาท<br>";
            echo "------------------------------------<br>";
        }else if ($s<=99999){
            echo "เงินเดือน = $s บาท<br>";
            echo "------------------------------------<br>";
            echo "ได้โบนัส = ".($s* 2)." บาท<br>";
            echo "รายรับสุทธิ = ".($s+($s* 2))." บาท<br>";
            echo "------------------------------------<br>";
        }else if ($s>=100000){
            echo "เงินเดือน = $s บาท<br>";
            echo "------------------------------------<br>";
            echo "ได้โบนัส = ".($s* 1)." บาท<br>";
            echo "รายรับสุทธิ = ".($s+($s* 1))." บาท<br>";
            echo "------------------------------------<br>";
        }
?>